{
  "jobs": [
    {
      "id": "nm",
      "type": "Full-time",
      "company": "Northwestern Mutual",
      "cityState": "Milwaukee, WI",
      "startDate": "March 2023",
      "endDate": "Present",
      "title": "Senior Software Engineer",
      "description": "N/A",
      "bullets": [
        "Ground up application development on a new product using React JS, Node JS, GraphQL, and TypeScript.",
        "Personal collaboration with lead designer to iterate on UI/UX concerns gained from user research.",
        "Work with project managers translating difficult to understand finance language into digestible UX goals.",
        "Created the financial data visualization portion of the application using D3 with visX.",
        "Unit test implementation with Jest on frontend and backend components."
      ]
    },
    {
      "id": "mit",
      "type": "Contract",
      "company": "Massachusetts Institute of Technology",
      "cityState": "Cambridge, Massachusetts",
      "startDate": "January 2024",
      "endDate": "January 2025",
      "title": "Senior Software Engineer",
      "description": "N/A",
      "bullets": [
        "Worked with the CRIPT team to build the data visualization portion of the CRIPT application.",
        "Used the VisX, React, and TypeScript to create data visualization of Polymer research data.",
        "Update/Refactor NodeJS and Python code to import the Research data into a CRIPT project.",
        "Worked with product management to design and develop a feature rich UI for researchers to quickly and clearly create visualizations of complex research data."
      ]
    },
    {
      "id": "evern",
      "type": "Full-time",
      "company": "Evernote",
      "cityState": "Redwood City, CA",
      "startDate": "April 2022",
      "endDate": "February 2023",
      "title": "Software Engineer II",
      "description": "N/A",
      "bullets": [
        "Member of the Growth and Monetization team.",
        "Take designs, analytic configurations, and direction from product team and translate that into A/B experiments on the component level.",
        "Implement monetization features in React Native for mobile application.",
        "Implement monetization features in React+Typescript for web/desktop application.",
        "Fastest on the team to finish an entire epic alone after start date.",
        "Spearheaded New Years Campaign monetization goals."
      ]
    },
    {
      "id": "gcio",
      "type": "Full-time",
      "company": "GovernementCIO",
      "cityState": "Washington, DC",
      "startDate": "September 2021",
      "endDate": "April 2022",
      "title": "Senior Software Engineer",
      "description": "N/A",
      "bullets": [
        "Work with veterans and stakeholders to deliver useful features for va.gov.",
        "Use Javascript and Liquid templates to generate VA location information across the US.",
        "Follow strict protocols for handling/accessing sensitive information."
      ]
    },
    {
      "id": "cara",
      "type": "Contract",
      "company": "Carallel LLC",
      "cityState": "Lake Forest, IL",
      "startDate": "October 2020",
      "endDate": "September 2021",
      "title": "Front End Engineer",
      "description": "N/A",
      "bullets": [
        "Refactor/Optimize React implementation to use React Hooks.",
        "Work within the Wordpress + React ecosystem.",
        "Work with offshore developers to bring new features to the application."
      ]
    },
    {
      "id": "xpdx",
      "type": "Full-time",
      "company": "XpertDox LLC",
      "cityState": "Birmingham, AL",
      "startDate": "June 2019",
      "endDate": "September 2021",
      "title": "Lead Developer",
      "description": "N/A",
      "bullets": [
        "Refactor application suite to use React Hooks.",
        "Design new applications and redesign old applications to improve UI/UX across the suite using ReactJS, NodeJS, Express, and MongoDB.",
        "Manage India based team education on react updates and coding standards, and development progress on applications. Perform code reviews for India team.",
        "Revamped entire development process from a “Develop First” process to a “Design First” process.",
        "Architect, design, and develop SSO app to centralize user login across applications.",
        "Build a reusable component library to speed up the development process and phase out unreliable/unsecure third party components."
      ]
    },
    {
      "id": "stnfn",
      "type": "Full-time",
      "company": "Standard Furniture",
      "cityState": "Bay Minette, AL",
      "startDate": "September 2018",
      "endDate": "June 2019",
      "title": "Javascript Developer",
      "description": "N/A",
      "bullets": [
        "Assist contracted teams in design and development of the new Ecomm website platform.",
        "Advise leadership on technical decisions in the design and development process as well as accessibility and SEO concerns.",
        "Use ReactJS, MongoDB, NodeJS, and Express to create Web applications to automate and speed up workflows throughout the company.",
        "Maintain Linux server on the intranet that hosts the suite of applications.",
        "Created KitBuilder: to quickly aggregate multiple products into a single kit and upload it to our cloud server.",
        "Created ImageBot: upload multiple images instantly and the bot will analyze the image names and compare them with matched products and sort them Into the correct image attributes. The bot will also clean other image data during the scan process to slowly perfect our data structure.",
        "Created QA submission: a web app that runs on a tablet and auto generates information and performs automatic calculations to drastically increase the speed of the product quality assurance process."
      ]
    },
    {
      "id": "svm",
      "type": "Full-time",
      "company": "Southern View Media",
      "logoClass": "square",
      "cityState": "Mobile, AL",
      "startDate": "January 2018",
      "endDate": "September 2018",
      "title": "Web Developer/Graphic Designer",
      "description": "N/A",
      "bullets": [
        "Design web graphics and rack cards for various businesses.",
        "Coordinate with designers and customers to create website or application to fit their needs.",
        "Design and build websites and web apps.",
        "Represent the company at weekly BNI meetings.",
        "Help educate other developers on the latest standards and help implement them into the workflow."
      ]
    },
    {
      "id": "ps",
      "type": "Full-time",
      "company": "Plus Sum Internet Marketing",
      "logoClass": "square",
      "cityState": "Mobile, AL",
      "startDate": "January 2016",
      "endDate": "2018",
      "title": "Owner/Lead Developer",
      "description": "N/A",
      "bullets": [
        "Started a small company developing websites for local business",
        "Developing websites with PHP and WORDPRESS ",
        "Consulting with customers.",
        "Selling website and SEO packages.",
        "Logo and Graphic Design.",
        "Coordinating entry level developers and content writers."
      ]
    },
    {
      "id": "afm",
      "type": "Full-time",
      "company": "A Factor Marketing",
      "cityState": "Mobile, AL",
      "logoClass": "square",
      "startDate": "May 2015",
      "endDate": "January 2016",
      "title": "Developer/Designer",
      "description": "N/A",
      "bullets": [
        "Develop websites assigned to me.",
        "Talk to customers and explain the development process.",
        "Collaborate with other developers on certain contracts.",
        "The go-to guy for logo and graphic design."
      ]
    }
  ],
  "education": [
    {
      "title": "Front End Web Development Tech Degree",
      "issuer": "teamtreehouse.com",
      "type": "Certificate",
      "startDate": "September 2016",
      "endDate": "May 2018",
      "url": "https://www.credential.net/jne09uqa"
    },
    {
      "title": "High School Diploma",
      "issuer": "Theodore High School",
      "type": "Education",
      "startDate": "2009",
      "endDate": "2012"
    }
  ]
}
